In [2]:
# 05 Membalik urutan baris dan kolom pada Data Frame

n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 10, size=(n_rows, n_cols)), 
                  columns=cols)
df

   A  B  C  D  E
0  5  6  3  3  2
1  2  9  6  3  2
2  8  2  8  5  3
3  3  8  1  8  1
4  8  7  1  5  8

In [1]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.0.3
1.24.3

In [3]:
# Membalik urutan kolom

df.loc[:, ::-1]

   E  D  C  B  A
0  2  3  3  6  5
1  2  3  6  9  2
2  3  5  8  2  8
3  1  8  1  8  3
4  8  5  1  7  8

In [4]:
# Mmebalik urutan baris
df.loc[::-1]

   A  B  C  D  E
4  8  7  1  5  8
3  3  8  1  8  1
2  8  2  8  5  3
1  2  9  6  3  2
0  5  6  3  3  2

In [5]:
# Membalik urutan baris dan melakukan penyesuaian ulang index

df.loc[::-1].reset_index(drop=True)

   A  B  C  D  E
0  8  7  1  5  8
1  3  8  1  8  1
2  8  2  8  5  3
3  2  9  6  3  2
4  5  6  3  3  2

In [8]:
# 06 Mengganti nama (label) kolom pada Data Frame

import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.0.3
1.24.3

In [10]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 10, size=(n_rows, n_cols)), 
                  columns=cols)
df

   A  B  C  D  E
0  9  9  2  3  9
1  6  4  1  7  6
2  9  9  9  5  6
3  4  5  4  2  8
4  6  5  9  5  5

In [11]:
# Mengganti nama (label) untuk sebuah kolom pada Data Frame 
df.rename(columns={'C':'Hobi'})

   A  B  Hobi  D  E
0  9  9     2  3  9
1  6  4     1  7  6
2  9  9     9  5  6
3  4  5     4  2  8
4  6  5     9  5  5

In [12]:
# Mengganti nama (label) untuk banyak kolom pada Data Frame 
df.rename(columns={'A':'Nama', 'B':'Alamat', 'D':'Kota'})

   Nama  Alamat  C  Kota  E
0     9       9  2     3  9
1     6       4  1     7  6
2     9       9  9     5  6
3     4       5  4     2  8
4     6       5  9     5  5

In [13]:
#07 Menghapus (drop)missing values (NaN)
n_rows = 30
n_cols = 4
cols = ['A', 'B', 'C', 'D']

df = pd.DataFrame(np.random.randn(n_rows, n_cols), columns=cols)

nan_mask = np.random.rand(n_rows, n_cols) < 0.2
df[nan_mask] = np.nan

df = df.reset_index()
df.head()

   index         A         B         C         D
0      0       NaN -1.260822       NaN  0.016794
1      1  0.180762       NaN       NaN       NaN
2      2       NaN -1.145289  0.008000  0.214251
3      3  0.333949       NaN  0.187655  1.677246
4      4       NaN  0.944146  0.829172 -1.463323

In [14]:
df = df.rename(columns={'index':'Z'})
df.head()

   Z         A         B         C         D
0  0       NaN -1.260822       NaN  0.016794
1  1  0.180762       NaN       NaN       NaN
2  2       NaN -1.145289  0.008000  0.214251
3  3  0.333949       NaN  0.187655  1.677246
4  4       NaN  0.944146  0.829172 -1.463323

In [17]:
df_backup = df.copy(deep=True)

In [18]:
df = df.dropna(axis='columns') 
df.head()

   Z
0  0
1  1
2  2
3  3
4  4

In [19]:
df = df_backup.copy(deep=True)
df = df.dropna(axis='rows')
df.head()

     Z         A         B         C         D
5    5  0.061628 -0.045787 -0.597246 -0.081886
12  12  2.068245  0.344785 -0.621512 -1.062220
17  17  0.666822 -0.887746  0.482055 -1.178415
21  21  0.337833 -0.259462 -1.526210  0.496486
23  23  0.635956  1.697980 -0.240690 -0.762779

In [20]:
df = df_backup.copy(deep=True)
df.isna().mean()

Z    0.000000
A    0.233333
B    0.133333
C    0.466667
D    0.233333
dtype: float64

In [21]:
treshold = len(df) * 0.9
df = df.dropna(thresh=treshold, axis='columns')
df.head()

   Z
0  0
1  1
2  2
3  3
4  4

In [22]:
#08 Memeriksa kesamaan antar dua buah kolom (Series) pada Data Frame
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.0.3
1.24.3

In [23]:
data = {'A':[15, 15, 18, np.nan, 12], 
        'B':[15, 15, 18, np.nan, 12]}

df = pd.DataFrame(data)
df

      A     B
0  15.0  15.0
1  15.0  15.0
2  18.0  18.0
3   NaN   NaN
4  12.0  12.0

In [24]:
#Mengenal Pandas Series
df['A']

0    15.0
1    15.0
2    18.0
3     NaN
4    12.0
Name: A, dtype: float64

In [25]:
type(df['A'])

pandas.core.series.Series

In [26]:
type(df)

pandas.core.frame.DataFrame

In [27]:
#Memeriksa kesamaan dengan operator ==
df['A'] == df['B']

0     True
1     True
2     True
3    False
4     True
dtype: bool

In [28]:
# Memeriksa kesamaan dengan method equals ()
df['A'].equals(df['B'])

True

In [29]:
# Memeriksa kesamaan antar dua Data Frame
df1 = df.copy(deep=True)

df.equals(df1)

True

In [30]:
df == df1

       A      B
0   True   True
1   True   True
2   True   True
3  False  False
4   True   True